[[["dbef4e3a-58d8-495b-9930-eb72628f1829",{"pageContent":"I'm Siddhanth Duggal, a Statistics and Biochemistry student at the University of British Columbia with a strong interest in artificial intelligence and the design of data-driven systems. \n\nI have a deep focus on AI because of its transformative potential to solve complex problems across industries and improve human decision-making through intelligent systems.\n\nI'm equally passionate about quantitative finance, drawn to the intersection of mathematics, statistics, and financial markets. Having st","metadata":{"source":"about.txt"}}],["e94bbe5c-5aa0-42cc-b9bb-7f54bd018af3",{"pageContent":"arted investing in high school, I enjoy staying current with market trends through The Wall Street Journal and exploring how quantitative methods drive trading strategies and risk management.\n\nAt my core, I'm a problem solver who thrives on breaking down complex challenges into manageable components. Whether I'm debugging code, analyzing market patterns, or optimizing data pipelines, I approach each problem with systematic thinking and creative solutions. This mindset extends beyond technical wo","metadata":{"source":"about.txt"}}],["190eea63-cbd8-487e-9916-b576029d119c",{"pageContent":"rk—I believe every challenge and failure is an opportunity to learn something new.\n\nCurious, analytical, and impact-driven, my work bridges technical research and practical application. I have interned across various domains, gaining perspective on how data can drive meaningful innovation. Alongside my technical work, I have led and collaborated on team-based projects across academic and corporate environments.\n\nI'm an avid reader with particular interests in psychology, philosophy, and strategi","metadata":{"source":"about.txt"}}],["1f58814a-d9a2-4a1b-9019-4f7044084f4e",{"pageContent":"c thinking. Some of my favorite books include 'Influence: The Psychology of Persuasion' by Robert Cialdini, 'Meditations' by Marcus Aurelius, 'The Prince' by Niccolò Machiavelli, and 'The Almanack of Naval Ravikant' by Eric Jorgenson.\n\nI'm also passionate about poker, which has taught me invaluable lessons about probability, risk management, and reading human behavior. The game perfectly combines mathematical precision with psychological insight, requiring constant adaptation and strategic think","metadata":{"source":"about.txt"}}],["70db89da-9e72-4364-8fc5-66edcd806745",{"pageContent":"ing. Poker has sharpened my ability to make decisions under uncertainty and manage risk—skills that translate directly to both quantitative finance and data science.\n\nOutside of code and data, I'm passionate about fitness as an amateur bodybuilder and powerlifter, with personal bests of 265 lbs bench press, 405 lbs squat, and 425 lbs deadlift. I draw inspiration from legends like Ronnie Coleman, Tom Platz, and Chris Bumstead. When I'm not in the gym, you'll find me playing football (lifelong FC","metadata":{"source":"about.txt"}}],["33b26bb9-ebd3-4274-aa9e-6917afaac3a8",{"pageContent":"Barcelona fan) or perfecting the art of brewing black coffee.\"","metadata":{"source":"about.txt"}}],["641bf39d-6d5e-4b0f-9ebe-0a8d1e7a7ae5",{"pageContent":"EDUCATION\n\nUniversity of British Columbia | Sep 2022 – May 2027\nBachelor of Science in Statistics and Biochemistry (Combined Major in Science), Vancouver, BC\nCoursework: Systematic Software Design, Machine Learning, Data Structures & Algorithms, Statistical Modelling","metadata":{"source":"education.txt"}}],["4b7239f0-dc3a-46c3-8f73-56c402107a58",{"pageContent":"WORK EXPERIENCE\n\nZamp | May 2025 – Aug 2025\nArtificial Intelligence and Go-To-Market Intern\n- Working at a Sequoia-backed agentic AI startup building autonomous workflows for finance operations at enterprises like Uber and DoorDash\n- Working on an AP automation agent that extracted invoice data and executed 2-way PO matching using document and decision agents - cutting AP processing time by 60% for enterprise users.\n- Built automation pipelines (via n8n + Slack + HubSpot) to feed LLM-powered dai","metadata":{"source":"experience.txt"}}],["e35ee207-a11c-49e9-baee-5f6054e2f9da",{"pageContent":"ly sales summaries to GTM teams, reducing manual review time by 80%.\n\niKites.AI | Jul 2024 – Dec 2024\nApplied Machine Learning Research Intern\n- Worked with Prof. Amit Sethi (IIT Bombay & University of Illinois at Chicago) on reimplementing his paper on classifying H&E stained breast tissue images into four categories using deep learning.\n- Fine-tuned the Inception-v3 CNN to achieve 93% accuracy for non-cancerous vs. malignant tissues, surpassing the previous benchmark of 83% (Araújo et al.)\n- R","metadata":{"source":"experience.txt"}}],["08335271-e10a-47ed-b3a6-452d92105e6f",{"pageContent":"esponsible for annotating and identifying Drusen segmentations on OCT retinal images to generate labels for a dataset.\n\nIngenuity Gaming | May 2024 – Jul 2024\nSoftware Development Intern | Remote, Vancouver, BC\n- Developed and deployed web-based slot games leveraging React, JavaScript, HTML, and CSS for a highly engaging user experience.\n- Optimized user engagement and retention by implementing UI features to enhance game aesthetics, leading to a 15% increase in user satisfaction ratings.\n\nErnst","metadata":{"source":"experience.txt"}}],["b051be7e-965a-4b56-8a99-fb3a56134f58",{"pageContent":"& Young (EY) | May 2023 – Aug 2023\nTransaction Diligence Intern\n- Performed financial due diligence on a U.S.-based chemical manufacturer, analyzing key financial metrics and industry trends to support M&A decisions.\n- Researched market positioning and financial performance of competitors in surfactants and ethylene derivatives, identifying valuation benchmarks and industry risks.\n\nMedanta Multi-Speciality Hospital | Apr 2022 – Aug 2022\nMachine Learning Intern | In-Person, New Delhi, IND\n- Deve","metadata":{"source":"experience.txt"}}],["75195dd0-7765-4afb-8a6c-cf9a2f1f9314",{"pageContent":"loped a classification model with the Director of Gastroenterology (Dr. Rajesh Puri) to aid in the diagnosis of pneumonia using X-ray imaging. Leveraged a Convolutional Neural Network to achieve 89.85% accuracy.\n- Implemented geometric data augmentation techniques to minimize false positives and false negatives.\n- Researched and evaluated AI ventures with hospital staff, resulting in the identification of socially impactful projects that could potentially benefit from AI implementation.","metadata":{"source":"experience.txt"}}],["b8cc2304-4e9b-4c25-955b-f72b9136a1f1",{"pageContent":"Name - Siddhanth Duggal\nLocation - Vancouver, BC\nEmail - sidkduggal@gmail.com\nNumber - +1 778-325-5927 \nLinkedin - linkedin.com/in/sidkduggal \nGithub - github.com/skduggal","metadata":{"source":"personal details.txt"}}],["268e0efb-958d-431a-88e7-eb5f2f367a0e",{"pageContent":"PROJECTS\n\nVibe-Rater Sentiment Analysis | Python, PyTorch, Transformers, VADER, Scikit-Learn\n- Developed a sentiment analysis pipeline for Instagram comments enabling real-time sentiment classification for social media analytics\n- Implemented VADER sentiment analysis to compute individual comment scores (“vibe ratings”) from 1-10.\n- Fine-tuned a pre-trained BERT model using a dataset of ~200,000 labeled comments from Reddit and Twitter to achieve a 87% classification accuracy rate in generating","metadata":{"source":"projects.txt"}}],["cf9f5f51-896e-4cd8-9bd0-c1cf6a4ef076",{"pageContent":"an aggregate “vibe” for each comment.\n\nEmotion Detection Using Deep Learning | Python, Tensorflow, Keras, OpenCV\n- Developed a deep learning approach to detect five distinct emotions from facial expressions in images, utilizing Multi-Layer Perceptrons, Convolutional Neural Networks, and transfer learning with VGG.\n- Used Dlib's frontal face detector to plot 68 key facial landmarks, and employed Sci-kit to standardize the data.\n- Achieved 76.9% accuracy using transfer learning — surpassing human","metadata":{"source":"projects.txt"}}],["2d3baac4-9555-4661-9b04-97d5342baa7c",{"pageContent":"accuracy of 65 ± 5% on the fer2013 dataset.\n\nEmail Spam Filtering Using K-NN\n- Developed and implemented a K-Nearest Neighbors (K-NN) classification model on the UCI Machine Learning Repository's spam email database.\n- Cleaned and wrangled information derived from 4601 emails and utilised forward selection to choose the most accurate predictor variables from the 57 continuous real variables present.\n- Trained and tested the model to achieve an accuracy of 84.36%.\n\nmacOS Terminal Portfolio\n- Inte","metadata":{"source":"projects.txt"}}],["c8922816-f243-4fd1-8bfa-0765b6620c01",{"pageContent":"grated OpenAI GPT API to power an AI terminal chat experience capable of answering questions about education, work experience, and technical skills.\n- Implemented Retrieval-Augmented Generation (RAG) architecture using Pinecone and LangChain to ground AI responses in my personal resume and project data.\n- Developed the front-end using Astro, React, and TailwindCSS, achieving a modern and responsive design optimized for desktop and mobile devices.\n\nWorkday2iCal\n- Developed a Python program to con","metadata":{"source":"projects.txt"}}],["b1ab26a5-14ba-4924-9db3-e02ea449bdb9",{"pageContent":"vert Workday schedule data exported from Excel into iCal format, enabling seamless integration with personal calendar applications.\n- Leveraged pandas for efficient data wrangling of Excel (.xlsx) files containing course schedules, ensuring robust handling of missing data entries.\n- Used the icalendar library to dynamically generate `.ics` files with properly formatted calendar events.\n- Designed a user prompt system for term selection and ensured error handling for invalid inputs, enhancing use","metadata":{"source":"projects.txt"}}],["563473de-7695-4e62-8993-001ecca19cce",{"pageContent":"r experience and minimizing incorrect exports.","metadata":{"source":"projects.txt"}}],["2456864c-e5c6-49a9-bf68-85f71c675554",{"pageContent":"TECHNICAL SKILLS\n\nLanguages: Python, R, Java, JavaScript, HTML/CSS, Dart/Flutter\nLibraries & Frameworks: PyTorch, Tensorflow, Keras, Scikit-Learn, OpenCV, React\nTools: Git, GitHub Actions, n8n, Slack APIs, HubSpot APIs","metadata":{"source":"skills.txt"}}]],{"0":"dbef4e3a-58d8-495b-9930-eb72628f1829","1":"e94bbe5c-5aa0-42cc-b9bb-7f54bd018af3","2":"190eea63-cbd8-487e-9916-b576029d119c","3":"1f58814a-d9a2-4a1b-9019-4f7044084f4e","4":"70db89da-9e72-4364-8fc5-66edcd806745","5":"33b26bb9-ebd3-4274-aa9e-6917afaac3a8","6":"641bf39d-6d5e-4b0f-9ebe-0a8d1e7a7ae5","7":"4b7239f0-dc3a-46c3-8f73-56c402107a58","8":"e35ee207-a11c-49e9-baee-5f6054e2f9da","9":"08335271-e10a-47ed-b3a6-452d92105e6f","10":"b051be7e-965a-4b56-8a99-fb3a56134f58","11":"75195dd0-7765-4afb-8a6c-cf9a2f1f9314","12":"b8cc2304-4e9b-4c25-955b-f72b9136a1f1","13":"268e0efb-958d-431a-88e7-eb5f2f367a0e","14":"cf9f5f51-896e-4cd8-9bd0-c1cf6a4ef076","15":"2d3baac4-9555-4661-9b04-97d5342baa7c","16":"c8922816-f243-4fd1-8bfa-0765b6620c01","17":"b1ab26a5-14ba-4924-9db3-e02ea449bdb9","18":"563473de-7695-4e62-8993-001ecca19cce","19":"2456864c-e5c6-49a9-bf68-85f71c675554"}]